Andrew-tesler/CecToUsb/CEC/driverlib/MSP430F5xx_6xx/aes.c
        // Set module to encrypt mode
        HWREG16(baseAddress + OFS_AESACTL0) &= ~AESOP_3;


        // Write data to encrypt to module
        for (i = 0; i < 16; i = i + 2) {
                tempVariable = (uint16_t)(Data[i]);
                tempVariable = tempVariable | ((uint16_t)(Data[i + 1]) << 8);
                HWREG16(baseAddress + OFS_AESADIN) = tempVariable;
        }

        // Key that is already written shall be used
        // Encryption is initialized by setting AESKEYWR to 1
        HWREG16(baseAddress + OFS_AESASTAT) |= AESKEYWR;

        return STATUS_SUCCESS;
}

//*****************************************************************************
//
//! \brief Decrypts a block of data using the AES module.
//!
//! This is the non-blocking equivalent of AES_decryptData(). This function
//! requires a pre-generated decryption key. A key can be loaded and pre-
//! generated by using function \b AES_setDecipherKey() or \b
//! AES_startSetDecipherKey(). The decryption takes 167 MCLK. It is recommended
//! to use interrupt to check for procedure completion then using
//! AES_getDataOut() API to retrieve the decrypted data.
//!
//! \param baseAddress is the base address of the AES module.
//! \param Data is a pointer to an uint8_t array with a length of 16 bytes that
//!        contains encrypted data to be decrypted.
//!
//! \return STATUS_SUCCESS
//
//*****************************************************************************
uint8_t AES_startDecryptData(uint16_t baseAddress,
                             const uint8_t * Data)
{
        uint8_t i;
        uint16_t tempVariable = 0;

        // Set module to decrypt mode
        HWREG16(baseAddress + OFS_AESACTL0) |= (AESOP_3);

        // Write data to decrypt to module
        for (i = 0; i < 16; i = i + 2) {
                tempVariable = (uint16_t)(Data[i + 1] << 8);
                tempVariable = tempVariable | ((uint16_t)(Data[i]));
                HWREG16(baseAddress + OFS_AESADIN) = tempVariable;
        }

        // Key that is already written shall be used
        // Now decryption starts
        HWREG16(baseAddress + OFS_AESASTAT) |= AESKEYWR;

        return STATUS_SUCCESS;
}

//*****************************************************************************
//
//! \brief Loads the decipher key.
//!
//! This is the non-blocking equivalent of AES_setDecipherKey(). The API \b
//! AES_startSetDecipherKey() or \b AES_setDecipherKey() must be invoked before
//! invoking \b AES_startSetDecipherKey().
//!
//! \param baseAddress is the base address of the AES module.
//! \param CipherKey is a pointer to an uint8_t array with a length of 16 bytes
//!        that contains the initial AES key.
//!
//! \return STATUS_SUCCESS
//
//*****************************************************************************
uint8_t AES_startSetDecipherKey(uint16_t baseAddress,
                                const uint8_t * CipherKey)
{
        uint8_t i;
        uint16_t tempVariable = 0;

        HWREG16(baseAddress + OFS_AESACTL0) &= ~(AESOP0);
        HWREG16(baseAddress + OFS_AESACTL0) |= AESOP1;

        // Write cipher key to key register
        for (i = 0; i < 16; i = i + 2) {
                tempVariable = (uint16_t)(CipherKey[i]);
                tempVariable = tempVariable | ((uint16_t)(CipherKey[i + 1]) << 8);
                HWREG16(baseAddress + OFS_AESAKEY) = tempVariable;
        }

        return STATUS_SUCCESS;
}

//*****************************************************************************
//
//! \brief Reads back the output data from AES module.
//!
//! This function is meant to use after an encryption or decryption process
//! that was started and finished by initiating an interrupt by use of the \b
//! AES_startEncryptData() or \b AES_startDecryptData() functions.
//!
//! \param baseAddress is the base address of the AES module.
//! \param OutputData is a pointer to an uint8_t array with a length of 16
//!        bytes in which the output data of the AES module is available. If
//!        AES module is busy returns NULL.
//!
//! \return STATUS_SUCCESS if AES is not busy, STATUS_FAIL if it is busy
//
//*****************************************************************************
uint8_t  AES_getDataOut(uint16_t baseAddress,
                        uint8_t *OutputData
                        )
{
        uint8_t i;
        uint16_t tempData = 0;

        // If module is busy, exit and return failure
        if ( AESBUSY == (HWREG16(baseAddress + OFS_AESASTAT) & AESBUSY))
                return STATUS_FAIL;

        // Write encrypted data back to variable
        for (i = 0; i < 16; i = i + 2) {
                tempData = HWREG16(baseAddress + OFS_AESADOUT);
                *(OutputData + i) = (uint8_t)tempData;
                *(OutputData + i + 1) = (uint8_t)(tempData >> 8);
        }

        return STATUS_SUCCESS;
}

//*****************************************************************************
//
//! \brief Gets the AES module busy status.
//!
//! Gets the AES module busy status. If a key or data are written while the AES
//! module is busy, an error flag will be thrown.
//!
//! \param baseAddress is the base address of the AES module.
//!
//! \return One of the following:
//!         - \b AES_BUSY
//!         - \b AES_NOT_BUSY
//!         \n indicating if encryption/decryption/key generation is taking
//!         place
//
//*****************************************************************************
uint8_t AES_isBusy(uint16_t baseAddress)
{
        return HWREG16(baseAddress + OFS_AESASTAT) & AESBUSY;
}

//*****************************************************************************
//
//! \brief Clears the AES error flag.
//!
//! Clears the AES error flag that results from a key or data being written
//! while the AES module is busy. Modified bit is AESERRFG of AESACTL0
//! register.
//!
//! \param baseAddress is the base address of the AES module.
//!
//! Modified bits are \b AESERRFG of \b AESACTL0 register.
//!
//! \return None
//
//*****************************************************************************
void AES_clearErrorFlag(uint16_t baseAddress )
{
        HWREG8(baseAddress + OFS_AESACTL0) &=  ~AESERRFG;
}

//*****************************************************************************
//
//! \brief Gets the AES error flag status.
//!
//! Checks the AES error flag that results from a key or data being written
//! while the AES module is busy. If the flag is set, it needs to be cleared
//! using AES_clearErrorFlag.
//!
//! \param baseAddress is the base address of the AES module.
//!
//! \return One of the following:
//!         - \b AES_ERROR_OCCURRED
//!         - \b AES_NO_ERROR
//!         \n indicating if AESAKEY or AESADIN were written while an AES
//!         operation was in progress
//
//*****************************************************************************
uint32_t AES_getErrorFlagStatus(uint16_t baseAddress)
{
        return HWREG8(baseAddress + OFS_AESACTL0) & AESERRFG;
}

//*****************************************************************************
//
//! \brief DEPRECATED Starts an decryption process on the AES module.
//!
//! This is the non-blocking equivalent of AES_decryptDataUsingEncryptionKey().
//! This function can be used to decrypt data by using the same key as used for
//! a previous performed encryption. The decryption takes 214 MCLK.
//!
//! \param baseAddress is the base address of the AES module.
//! \param Data is a pointer to an uint8_t array with a length of 16 bytes that
//!        contains encrypted data to be decrypted.
//!
//! \return STATUS_SUCCESS
//
//*****************************************************************************
uint8_t AES_startDecryptDataUsingEncryptionKey(
        uint16_t baseAddress,
        const uint8_t * Data)
{
        uint8_t i;
        uint16_t tempVariable = 0;

        // Set module to decrypt mode
        HWREG16(baseAddress + OFS_AESACTL0) &= ~(AESOP1);
        HWREG16(baseAddress + OFS_AESACTL0) |= AESOP0;

        // Write data to decrypt to module
        for (i = 0; i < 16; i = i + 2) {
                tempVariable = (uint16_t)(Data[i + 1] << 8);
                tempVariable = tempVariable | ((uint16_t)(Data[i]));
                HWREG16(baseAddress + OFS_AESADIN) = tempVariable;
        }

        // Key that is already written shall be used
        // Now decryption starts
        HWREG16(baseAddress + OFS_AESASTAT) |= AESKEYWR;

        return STATUS_SUCCESS;
}

//*****************************************************************************
//
//! \brief DEPRECATED Decrypts a block of data using the AES module.
//!
//! This function can be used to decrypt data by using the same key as used for
//! a previous performed encryption. The decryption takes 214 MCLK.
//!
//! \param baseAddress is the base address of the AES module.
//! \param Data is a pointer to an uint8_t array with a length of 16 bytes that
//!        contains encrypted data to be decrypted.
//! \param decryptedData is a pointer to an uint8_t array with a length of 16
//!        bytes in that the decrypted data will be written.
//!
//! \return STATUS_SUCCESS
//
//*****************************************************************************
uint8_t AES_decryptDataUsingEncryptionKey(uint16_t baseAddress,
                                          const uint8_t * Data,
                                          uint8_t * decryptedData)
{
        uint8_t i;
        uint16_t tempData = 0;
        uint16_t tempVariable = 0;

        // Set module to decrypt mode
        HWREG16(baseAddress + OFS_AESACTL0) &= ~(AESOP1);
        HWREG16(baseAddress + OFS_AESACTL0) |= AESOP0;

        // Write data to decrypt to module
        for (i = 0; i < 16; i = i + 2) {
                tempVariable = (uint16_t)(Data[i + 1] << 8);
                tempVariable = tempVariable | ((uint16_t)(Data[i]));
                HWREG16(baseAddress + OFS_AESADIN) = tempVariable;
        }

        // Key that is already written shall be used
        // Now decryption starts
        HWREG16(baseAddress + OFS_AESASTAT) |= AESKEYWR;

        // Wait unit finished ~214 MCLK
        while (AESBUSY == (HWREG16(baseAddress + OFS_AESASTAT) & AESBUSY) ) ;

        // Write encrypted data back to variable
        for (i = 0; i < 16; i = i + 2) {
                tempData = HWREG16(baseAddress + OFS_AESADOUT);
                *(decryptedData + i ) = (uint8_t)tempData;
                *(decryptedData + i + 1) = (uint8_t)(tempData >> 8);
        }

        return STATUS_SUCCESS;
}

#endif
//*****************************************************************************
//
//! Close the doxygen group for aes_api
//! @}
//
//*****************************************************************************
